In [15]:
import pandas as pd

In [1]:
cities = ['Atlanta', 'Boston', 'Chicago', 'Charlotte', 'Dallas-Fort Worth', 'Denver', 'Detroit', 'Houston', 'Las Vegas', 'Los Angeles', 'Miami', 'Minneapolis', 'Orlando', 'Philadelphia', 'Phoenix', 'San Francisco', 'New York', 'Seattle', 'Newark']

In [24]:
df = pd.read_csv('data/airports-passengers-month.csv', sep=';')

In [25]:
df

     City_departure  Year  Month  DOMESTIC  INTERNATIONAL    TOTAL
0           Atlanta  2007      1   2744136         332738  3076874
1           Atlanta  2007      2   2642977         302883  2945860
2           Atlanta  2007      3   3347887         393886  3741773
3           Atlanta  2007      4   3222845          34874  3571585
4           Atlanta  2007      5   3318869         387551  3706420
...             ...   ...    ...       ...            ...      ...
2275        Seattle  2016      8   2057429         240776  2298205
2276        Seattle  2016      9   1679948         209161  1889109
2277        Seattle  2016     10   1586543         190751  1777294
2278        Seattle  2016     11   1510143         170829  1680972
2279        Seattle  2016     12   1574435         211415  1785850

[2280 rows x 6 columns]